# Задайте число. Составьте список чисел Фибоначчи, в том числе для отрицательных индексов.
# Пример: - для k = 8 список будет выглядеть так: [-21 ,13, -8, 5, −3, 2, −1, 1, 0, 1, 1, 2, 3, 5, 8, 13, 21] 

numder = int(input("Введите  число:"))
a = [0,1]
b = []
for i in range(2, numder):
    a.append(a[i-1]+ a[i-2])
for i in range(1, numder):
    b.append((-1)**(i+1)*a[i])
a = b[::-1]+a
print(a)

